Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранения</Name>
					<Comment>Срок хранения (дней)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартинкаНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗадаетсяНаХарактеристику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ингредиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВПроизводстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьХарактеристикиНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорииТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//cbcb  555555+
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Характерестика();
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.ФайлКартинки, "ДанныеКартинки");
КонецПроцедуры

&НаСервере
Процедура Характерестика()
	Тек = Справочники.ПараметрыКонтекстныхФункциональныхОпций.Контекст.ПолучитьОбъект();
	Если Объект.ИспользоватьХарактеристикиНоменклатуры Тогда
		Тек.ИспользоватьХарактеристикиНоменклатуры = Истина;
		Тек.Записать();
	Иначе 
		Тек.ИспользоватьХарактеристикиНоменклатуры = Ложь;
		Тек.Записать();
	КонецЕсли;	
	Элементы.ЦенаЗадаетсяНаХарактеристику.ТолькоПросмотр = ?(Объект.ИспользоватьХарактеристикиНоменклатуры,Ложь,Истина);
	//Объект.ЦенаЗадаетсяНаХарактеристику = ?(Объект.ИспользоватьХарактеристикиНоменклатуры,Истина);
	Если Не Объект.ИспользоватьХарактеристикиНоменклатуры Тогда 
		Объект.ЦенаЗадаетсяНаХарактеристику = Ложь;		
	КонецЕсли;
КонецПроцедуры // Характерестика()

&НаСервере
Процедура КатегорииТоваровПриИзмененииНаСервере()
	Объект.ИспользоватьХарактеристикиНоменклатуры = Объект.КатегорииТоваров.ИспользоватьХарактеристикиНоменклатуры;
	Объект.ЦенаЗадаетсяНаХарактеристику = Объект.КатегорииТоваров.ЦенаЗадаетсяНаХарактеристику;
	Характерестика();
	Структура = Новый Структура();
	УстановитьПараметрыФункциональныхОпцийФормы(Структура);
КонецПроцедуры

&НаКлиенте
Процедура КатегорииТоваровПриИзменении(Элемент)
	КатегорииТоваровПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФайлКартинкиПриИзмененииНаСервере()
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.ФайлКартинки, "ДанныеКартинки");
КонецПроцедуры

&НаКлиенте
Процедура ФайлКартинкиПриИзменении(Элемент)
	ФайлКартинкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура TestlarUchun(Команда)
	ЧислоШтрихкодов = 6;
	Предупреждение("%ЧислоШтрихкодов%",);
КонецПроцедуры
